Repository: alexm/shadow.cat
Catalog: shadow.cat-level2.tmx
Source language: en_us
Languages: ca

source: Method modifiers are often used as an alternative to overriding a method in a parent class.
ca: Els modificadors de mètode s'utilitzen sovint com a alternativa a sobreescriure un mètode d'una classe pare.

source: They are also used in roles as a way of modifying methods in the consuming class.
ca: També s'utilitzen als rols com una manera de modificar els mètodes a la classe que els consumeix.

source: Under the hood, a method modifier is just a plain old Perl subroutine that gets called before or after (or around, etc.) some named method.
ca: Internament, un modificador de mètode és una subrutina tradicional de Perl que s'executa abans o després (o enmig, etc.) d'algun mètode amb nom.

source: =head2 Type
ca: =head2 Tipus

source: Moose also comes with a (miniature) type system.
ca: Moose també duu un sistema de tipus (en miniatura).

source: This allows you to define types for attributes.
ca: Això us permet definir tipus per als atributs.

source: Moose has a set of built-in types based on what Perl provides, such as C<Str>, C<Num>, C<Bool>, C<HashRef>, etc.
ca: Moose té un conjunt de tipus integrats que es basen en el que ofereix Perl, com ara C<Str>, C<Num>, C<Bool>, C<HashRef>, etc.

source: In addition, every class name in your application can also be used as a type name.
ca: Addicionalment, cada nom de classe de la vostra aplicació també es pot utilitzar com un nom de tipus.

source: Finally, you can define your own types, either as subtypes or entirely new types, with their own constraints.
ca: Finalment, podeu definir els vostres propis tipus, ja siguin subtipus o tipus totalment nous, amb les seves pròpies restriccions.

source: For example, you could define a type C<PosInt>, a subtype of C<Int> which only allows positive numbers.
ca: Per exemple, podeu definir un tipus C<PosInt>, un subtipus d'C<Int> que només permet números positius.

source: =head2 Delegation
ca: =head2 Delegació

source: Moose attributes provide declarative syntax for defining delegations.
ca: Els atributs de Moose ofereixen una sintaxi declarativa per a definir les delegacions.

source: A delegation is a method which calls some method on an attribute to do its real work.
ca: Una delegació és un mètode que crida algun altre mètode d'un atribut per a fer la feina de veritat.

source: A constructor creates an B<object instance> for the class.
ca: Un constructor crea una B<instància de l'objecte> per a una classe.

source: In old school Perl, this was usually done by defining a method called C<new()> which in turn called C<bless> on a reference.
ca: En Perl de la vella escola això es feia normalment definint un mètode anomenat C<new()>, que al seu torn cridava C<bless> sobre una referència.

source: With Moose, this C<new()> method is created for you, and it simply does the right thing.
ca: Amb Moose, aquest mètode C<new()> es crea per a vosaltres i simplement fa el que ha de fer.

source: You should never need to define your own constructor!
ca: No us hauria de caldre mai definir el vostre propi constructor!

source: Sometimes you want to do something whenever an object is created.
ca: De vegades voleu fer alguna cosa quan es crea un objecte.

source: In those cases, you can provide a C<BUILD()> method in your class.
ca: En aquests casos podeu definir el mètode C<BUILD()> a la vostra classe.

source: Moose will call this for you after creating a new object.
ca: Moose el cridarà just després de crear un nou objecte.

source: This is a special method called when an object instance goes out of scope.
ca: Aquest és un mètode especial que es crida quan una instància de l'objecte surt fora de context.

source: You can specialize what your class does in this method if you need to, but you usually don't.
ca: Podeu refinar el que fa la vostra classe en aquest mètode si us cal, però normalment no us caldrà.

source: With old school Perl 5, this is the C<DESTROY()> method, but with Moose it is the C<DEMOLISH()> method.
ca: Amb el Perl de la vella escola s'utilitzava el mètode C<DESTROY()>, però amb Moose és el mètode C<DEMOLISH()>.

source: =head2 Object instance
ca: =head2 Herència d'objectes

source: An object instance is a specific noun in the class's "category".
ca: Una instància de l'objecte és un nom específic a la "categoria" de la classe.

source: For example, one specific Person or User.
ca: Per exemple, una Persona o un Usuari específics.

source: An instance is created by the class's B<constructor>.
ca: Una instància es crea amb el B<constructor> de la classe.

source: An instance has values for its attributes.
ca: Una instància té valors per als seus atributs.

source: For example, a specific person has a first and last name.
ca: Per exemple, una persona específica té un nom i un cognom.

source: In old school Perl 5, this is often a blessed hash reference.
ca: Amb Perl de la vella escola això normalment seria una referència beneïda a una taula de dispersió.

source: With Moose, you should never need to know what your object instance actually is.
ca: Amb Moose no us hauria de caldre mai saber quina és la vostra instància de l'objecte.

source: (Okay, it's usually a blessed hashref with Moose, too.)
ca: (D'acord, normalment també és una referència beneïda a una taula de dipsersió a Moose).

source: =head2 Moose vs old school summary
ca: =head2 Resum de Moose contra Perl de la vella escola

source: =item * Class
ca: =item * Classe

source: A package with no introspection other than mucking about in the symbol table.
ca: Un paquet sense cap altra introspecció a banda de potinejar la taula de símbols.

source: With Moose, you get well-defined declaration and introspection.
ca: Amb Moose obteniu una declaració i una introspecció ben definides.

source: =item * Attributes
ca: =item * Atributs

source: Hand-written accessor methods, symbol table hackery, or a helper module like C<Class::Accessor>.
ca: Mètodes accessors escrits a mà, manipulació de la taula de símbols, o un mòdul d'ajuda com ara C<Class::Accessor>.

source: With Moose, these are declaratively defined, and distinct from methods.
ca: Amb Moose es defineixen d'una forma declarativa i diferent dels mètodes.

source: =item * Method
ca: =item * Mètode

source: These are pretty much the same in Moose as in old school Perl.
ca: Són pràcticament iguals a Moose que a Perl de la vella escola.

source: =item * Roles
ca: =item * Rols

source: C<Class::Trait> or C<Class::Role>, or maybe C<mixin.pm>.
ca: C<Class::Trait> o C<Class::Role>, o potser C<mixin.pm>.

source: With Moose, they're part of the core feature set, and are introspectable like everything else.
ca: Amb Moose són part central del conjunt de característiques i se'n pot fer introspecció com en qualsevol altra cosa.

source: =item * Method Modifiers
ca: =item * Modificadors de mètode

source: Could only be done through serious symbol table wizardry, and you probably never saw this before (at least in Perl 5).
ca: Només es podria aconseguir fent màgia amb la taula de símbols, i segurament no ho havíeu vist mai fins ara (si més no a Perl 5).

source: =item * Type
ca: =item * Tipus

source: Hand-written parameter checking in your C<new()> method and accessors.
ca: Comprovació a mà dels paràmetres als vostres mètodes C<new()> i als accessors.

source: With Moose, you define types declaratively, and then use them by name in your attributes.
ca: Amb Moose definiu els tipus de forma declarativa i aleshores els utilitzeu pel nom en els vostres atributs.

source: =item * Delegation
ca: =item * Delegació

source: C<Class::Delegation> or C<Class::Delegator>, but probably even more hand-written code.
ca: C<Class::Delegation> o C<Class::Delegator>, però probablement encara més codi escrit a mà.

source: With Moose, this is also declarative.
ca: Amb Moose això també és declaratiu.

source: A C<new()> method which calls C<bless> on a reference.
ca: Un mètode C<new()> que crida C<bless> sobre una referència.

source: Comes for free when you define a class with Moose.
ca: És gratis quan definiu una classe amb Moose.

source: A C<DESTROY()> method.
ca: Un mètode C<DESTROY()>.

source: With Moose, this is called C<DEMOLISH()>.
ca: Amb Moose s'anomena C<DEMOLISH()>.

source: =item * Object Instance
ca: =item * Instància de l'objecte

source: A blessed reference, usually a hash reference.
ca: Una referència beneïda, normalment una referència a una taula de dispersió.

source: With Moose, this is an opaque thing which has a bunch of attributes and methods, as defined by its class.
ca: Amb Moose es tracta d'una cosa opaca que té un seguit d'atributs i mètodes, segons s'hagi definit la classe.

source: =item * Immutabilization
ca: =item * Immutabilitat

source: Moose comes with a feature called "immutabilization".
ca: Moose té una característica anomenada "immutabilitat".

source: When you make your class immutable, it means you're done adding methods, attributes, roles, etc.
ca: Quan feu la vostra classe immutable, significa que heu acabat d'afegir-hi mètodes, atributs, rols, etc.

source: This lets Moose optimize your class with a bunch of extremely dirty in-place code generation tricks that speed up things like object construction and so on.
ca: Això permet que Moose optimitzi la vostra classe amb un seguit de trucs de generació de codi extremadament bruts que acceleren coses com ara la construcció d'objectes i tota la pesca.

source: =head1 META WHAT?
ca: =head1 META QUÈ?

source: A metaclass is a class that describes classes.
ca: Una meta-classe és una classe que descriu d'altres classes.

source: With Moose, every class you define gets a C<meta()> method.
ca: Amb Moose cada classe que definiu té un mètode C<meta()>.

source: It returns a L<Moose::Meta::Class> object, which has an introspection API that can tell you about the class it represents.
ca: Retorna un objecte L<Moose::Meta::Class>, que té una API d'introspecció que us pot parlar sobre la classe que representa.

source: Almost every concept we defined earlier has a meta class, so we have L<Moose::Meta::Class>, L<Moose::Meta::Attribute>, L<Moose::Meta::Method>, L<Moose::Meta::Role>, L<Moose::Meta::TypeConstraint>, L<Moose::Meta::Instance>, and so on.
ca: Gairebé qualsevol concepte que hem definit fins ara té una meta-classe, així tenim L<Moose::Meta::Class>, L<Moose::Meta::Attribute>, L<Moose::Meta::Method>, L<Moose::Meta::Role>, L<Moose::Meta::TypeConstraint>, L<Moose::Meta::Instance>, etc.

source: =head1 BUT I NEED TO DO IT MY WAY!
ca: =head1 PERÒ NECESSITO FER-HO A LA MEVA MANERA!

source: One of the great things about Moose is that if you dig down and find that it does something the "wrong way", you can change it by extending a metaclass.
ca: Una de les coses grans de Moose és que si caveu prou fons i trobeu que fa alguna cosa "malament", podeu canviar-ho extenent una meta-classe.

source: For example, you can have arrayref based objects, you can make your constructors strict (no unknown parameters allowed!), you can define a naming scheme for attribute accessors, you can make a class a Singleton, and much, much more.
ca: Per exemple, podeu tenir objectes basats en referències a una matriu, podeu fer que els vostres constructors siguin estrictes (no acceptaran paràmetres desconeguts!), podeu definir l'esquema per anomenar els accessors dels atributs, podeu fer que una classe tingui el patró Singleton i moltíssimes més coses.

source: Many of these extensions require surprisingly small amounts of code, and once you've done it once, you'll never have to hand-code "your way of doing things" again.
ca: Sorprenentment, moltes d'aquestes extensions només necessiten quantitats petites de codi i, un cop ho heu fet una vegada, no us caldrà programar a mà "la vostra manera de fer-ho" mai més.

source: Instead you'll just load your favorite extensions.
ca: Només caldrà que carregueu les vostres extensions preferides.

source: =head1 WHAT NEXT?
ca: =head1 I ARA QUÈ?

source: So you're sold on Moose.
ca: Ja us hem venut Moose.

source: Time to learn how to really use it.
ca: Ara és hora d'aprendre realment a utilitzar-lo.

source: If you want to see how Moose would translate directly into old school Perl 5 OO code, check out L<Moose::Manual::Unsweetened>.
ca: Si voleu veure com faríeu el que feu amb Moose però amb OO de Perl 5 de la vella escola, feu un cop d'ull a L<Moose::Manual::Unsweetened>.

source: This might be helpful for quickly wrapping your brain around some aspects of "the Moose way".
ca: Això pot ser útil per tal que el vostre cervell s'acostumi a "la manera de Moose" d'enfocar algunes coses.

source: Or you can skip that and jump straight to L<Moose::Manual::Classes> and the rest of the L<Moose::Manual>.
ca: O podeu saltar-vos-ho i saltar directament a L<Moose::Manual::Classes> i la resta del L<Moose::Manual>.

source: After that we recommend that you start with the L<Moose::Cookbook>.
ca: Després, us recomanem que comenceu amb el L<Moose::Cookbook>.

source: If you work your way through all the recipes under the basics section, you should have a pretty good sense of how Moose works, and all of its basic OO features.
ca: Si aconseguiu passar més enllà de les receptes de la secció de conceptes bàsics, hauríeu de tenir una bona idea de com funciona Moose i totes les seves característiques d'OO.

source: After that, check out the Role recipes.
ca: Després, feu un cop d'ull a les receptes de rols.

source: If you're really curious, go on and read the Meta and Extending recipes, but those are mostly there for people who want to be Moose wizards and change how Moose works.
ca: Si realment teniu curiositat, seguiu llegint les receptes de Meta i Extending, però aquelles són principalment per volen ser mags de Moose i canviar la manera com funciona Moose.
